//数组指针—指针
#include <stdio.h>
//int main()
//{
//	int* p = NULL;//p是整型指针-指向整型的指针-可以用来存放整型的地址
//	char* pc = NULL;//pc是字符指针-指向字符的指针-可以用来存放字符的地址
//	int arr[ ] = { 0 };//arr是数组名，首元素地址，==&arr[a],   &arr是数组的地址
//	int(*parr)[] = &arr;//数组指针- 
//
//	return 0;
//}
//int main()
//{
//	char* arr[5];//此数组 名 arr ， 共有五个元素，每个元素的类型是char*
//	char* (*pa)[5]=&arr;//注意： char (*p)[5]=&arr
//	return 0;
//}
////困了，划水。

//数组名VS &数组名
//+1的结果是不一样的 一个是 跳过一个元素 一个是跳过一个数组

//int main() //一维数组中使用数组指针并不方便
//{
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	int* p = arr;
//	for (int i = 0; i < 10;  i++)
//	{
//		printf("%d ",*(arr+i));
//		printf("%d ", *(p + i));
//	}
//	//int(*p)[10] = &arr;
//	//int i = 0;
//	//for (i = 0; i < 10; i++)
//	//{
//	//	printf("%d ", *(*p + i));
//	//}
//	//printf("\n");
//	//for (i = 0; i < 10; i++)
//	//{
//	//	printf("%p ", *p + i);//*p+1 跳4        p==&arr *p==arr
//	//}
//	//printf("\n");
//	//for ( i = 0; i < 10; i++)
//	//{
//	//	printf("%d ",(*p)[i]);
//	//}
//	//return 0;
//}

//数组指针一般用于二维以上的数组
//int main()
//{
//	int arr[3][5] = { {1,2,3,4,5},{2,3,4,5,6},{3,4,5,6,7} };
//	int(*p)[3][5] = &arr;//p==&arr
//	int i = 0;
//	for ( i = 0; i < 3; i++)
//	{
//		int j = 0;
//		for (j = 0; j < 5; j++)
//		{
//			printf("%d ", (*p)[i][j]);
//		}
//		printf("\n");
//	}
//	return 0;
//}
//二维数组中 arr是数组名，就是首元素地址
//二维数组首元素地址是   将其认为是一维数组 即有3个元素的一维数组，则其首元素地址就是第一行的地址。
// p==第一行的地址  p+1(p+i)每一行的地址 这个解引用 相当于拿到了这一行的数组名
//void print1(int x, int y,int (*p)[5]) //必须用5不可以用y
//{
//	int i = 0;
//	for (i = 0; i < x; i++)
//	{
//		for (int j=0; j < y; j++)
//		{
//			//printf("%d ", *(*(p + i) + j));//同下
//			printf("%d ", (*(p + i))[j]);
//		}
//		printf("\n");
//	}
//}
//int main()
//{
//	int arr[3][5] = { {1,2,3,4,5},{2,3,4,5,6},{3,4,5,6,7} };
//	print1(3, 5, arr);
//	return 0;
//}
// arr[i] == *(arr+i) == p[i] == *(p+i)

//int arr[5];  5个元素的整型数组
//nt* parr1[10];  10个元素的指针数组
//int(*parr2)[10]; 指向了一个有10个元素的整型数组的指针
//int(*parr3[10])[5];  parr3 是一个数组， 该数组有10个元素，每个元素是一个数组指针，该数组指针指向的数组有5个元素，每个元素是INT
